## Plan Result (ithc-apim)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain will be created
  + resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      + api_management_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-ithc"
      + id                = (known after apply)

      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "sds-api-mgmt.ithc.platform.hmcts.net"
          + key_vault_id                 = "https://acmedtssdsithc.vault.azure.net/secrets/wildcard-ithc-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "sds-api-mgmt-appgw.ithc.platform.hmcts.net"
          + key_vault_id                 = "https://acmedtssdsithc.vault.azure.net/secrets/wildcard-ithc-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "sds-mtls-api-mgmt-appgw.ithc.platform.hmcts.net"
          + key_vault_id                 = "https://acmedtssdsithc.vault.azure.net/secrets/wildcard-ithc-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":465,"Program":"tfcmt","SHA1":"","Target":"ithc-apim","Vars":{}} -->